nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm4(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA0 (coord B10), BUTTON_NMI
  @{ */
#define BOARD_INITBUTTONSPINS_SW2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITBUTTONSPINS_SW2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 0U                       /*!<@brief PORTA pin index: 0 */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITBUTTONSPINS_SW2_PIN 0U                            /*!<@brief PORTA pin index: 0 */
#define BOARD_INITBUTTONSPINS_SW2_CHANNEL 0                         /*!<@brief GPIOA GPIO channel: 0 */
#define BOARD_INITBUTTONSPINS_SW2_PIN_NAME PTA0                     /*!<@brief Pin name */
#define BOARD_INITBUTTONSPINS_SW2_LABEL "BUTTON_NMI"                /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW2_NAME "SW2"                        /*!<@brief Identifier name */
#define BOARD_INITBUTTONSPINS_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTE8 (coord P16), BUTTON_LLWUP23
  @{ */
#define BOARD_INITBUTTONSPINS_SW3_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW3_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITBUTTONSPINS_SW3_FGPIO FGPIOE                      /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 8U                       /*!<@brief PORTE pin index: 8 */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITBUTTONSPINS_SW3_PIN 8U                            /*!<@brief PORTE pin index: 8 */
#define BOARD_INITBUTTONSPINS_SW3_CHANNEL 8                         /*!<@brief GPIOE GPIO channel: 8 */
#define BOARD_INITBUTTONSPINS_SW3_PIN_NAME PTE8                     /*!<@brief Pin name */
#define BOARD_INITBUTTONSPINS_SW3_LABEL "BUTTON_LLWUP23"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW3_NAME "SW3"                        /*!<@brief Identifier name */
#define BOARD_INITBUTTONSPINS_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTE9 (coord N16), BUTTON_LLWUP24
  @{ */
#define BOARD_INITBUTTONSPINS_SW4_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW4_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITBUTTONSPINS_SW4_FGPIO FGPIOE                      /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITBUTTONSPINS_SW4_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW4_GPIO_PIN 9U                       /*!<@brief PORTE pin index: 9 */
#define BOARD_INITBUTTONSPINS_SW4_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITBUTTONSPINS_SW4_PIN 9U                            /*!<@brief PORTE pin index: 9 */
#define BOARD_INITBUTTONSPINS_SW4_CHANNEL 9                         /*!<@brief GPIOE GPIO channel: 9 */
#define BOARD_INITBUTTONSPINS_SW4_PIN_NAME PTE9                     /*!<@brief Pin name */
#define BOARD_INITBUTTONSPINS_SW4_LABEL "BUTTON_LLWUP24"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW4_NAME "SW4"                        /*!<@brief Identifier name */
#define BOARD_INITBUTTONSPINS_SW4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTE12 (coord L12), BUTTON_LLWUP26
  @{ */
#define BOARD_INITBUTTONSPINS_SW5_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW5_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITBUTTONSPINS_SW5_FGPIO FGPIOE                      /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITBUTTONSPINS_SW5_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITBUTTONSPINS_SW5_GPIO_PIN 12U                      /*!<@brief PORTE pin index: 12 */
#define BOARD_INITBUTTONSPINS_SW5_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITBUTTONSPINS_SW5_PIN 12U                           /*!<@brief PORTE pin index: 12 */
#define BOARD_INITBUTTONSPINS_SW5_CHANNEL 12                        /*!<@brief GPIOE GPIO channel: 12 */
#define BOARD_INITBUTTONSPINS_SW5_PIN_NAME PTE12                    /*!<@brief Pin name */
#define BOARD_INITBUTTONSPINS_SW5_LABEL "BUTTON_LLWUP26"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW5_NAME "SW5"                        /*!<@brief Identifier name */
#define BOARD_INITBUTTONSPINS_SW5_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA22 (coord B6), Q6[2]/LED_BLUE
  @{ */
#define BOARD_INITLEDSPINS_RGB_BLUE_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_BLUE_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITLEDSPINS_RGB_BLUE_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_BLUE_GPIO_PIN 22U                       /*!<@brief PORTA pin index: 22 */
#define BOARD_INITLEDSPINS_RGB_BLUE_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITLEDSPINS_RGB_BLUE_PIN 22U                            /*!<@brief PORTA pin index: 22 */
#define BOARD_INITLEDSPINS_RGB_BLUE_CHANNEL 22                         /*!<@brief GPIOA GPIO channel: 22 */
#define BOARD_INITLEDSPINS_RGB_BLUE_PIN_NAME PTA22                     /*!<@brief Pin name */
#define BOARD_INITLEDSPINS_RGB_BLUE_LABEL "Q6[2]/LED_BLUE"             /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_BLUE_NAME "RGB_BLUE"                    /*!<@brief Identifier name */
#define BOARD_INITLEDSPINS_RGB_BLUE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTA23 (coord E6), Q7[5]/LED_GREEN
  @{ */
#define BOARD_INITLEDSPINS_RGB_GREEN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_GREEN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITLEDSPINS_RGB_GREEN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_GREEN_GPIO_PIN 23U                       /*!<@brief PORTA pin index: 23 */
#define BOARD_INITLEDSPINS_RGB_GREEN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITLEDSPINS_RGB_GREEN_PIN 23U                            /*!<@brief PORTA pin index: 23 */
#define BOARD_INITLEDSPINS_RGB_GREEN_CHANNEL 23                         /*!<@brief GPIOA GPIO channel: 23 */
#define BOARD_INITLEDSPINS_RGB_GREEN_PIN_NAME PTA23                     /*!<@brief Pin name */
#define BOARD_INITLEDSPINS_RGB_GREEN_LABEL "Q7[5]/LED_GREEN"            /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_GREEN_NAME "RGB_GREEN"                   /*!<@brief Identifier name */
#define BOARD_INITLEDSPINS_RGB_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                        /* @} */

