nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*! @name PORTA24 (coord D6), Q7[2]/LED_RED
  @{ */
#define BOARD_INITLEDSPINS_RGB_RED_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_RED_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITLEDSPINS_RGB_RED_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITLEDSPINS_RGB_RED_GPIO_PIN 24U                       /*!<@brief PORTA pin index: 24 */
#define BOARD_INITLEDSPINS_RGB_RED_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITLEDSPINS_RGB_RED_PIN 24U                            /*!<@brief PORTA pin index: 24 */
#define BOARD_INITLEDSPINS_RGB_RED_CHANNEL 24                         /*!<@brief GPIOA GPIO channel: 24 */
#define BOARD_INITLEDSPINS_RGB_RED_PIN_NAME PTA24                     /*!<@brief Pin name */
#define BOARD_INITLEDSPINS_RGB_RED_LABEL "Q7[2]/LED_RED"              /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_RED_NAME "RGB_RED"                     /*!<@brief Identifier name */
#define BOARD_INITLEDSPINS_RGB_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */
//note can be FGPIE on cortex M0+    
#define BOARD_INITLEDSPINS_LED_RED_PERIPHERAL GPIOE                   /*!<@brief Device name: GPIOE */
#define BOARD_INITLEDSPINS_LED_RED_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITLEDSPINS_LED_RED_GPIO GPIOE                         /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN 0U                       /*!<@brief PORTE pin index: 0 */
#define BOARD_INITLEDSPINS_LED_RED_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITLEDSPINS_LED_RED_PIN 0U                            /*!<@brief PORTE pin index: 0 */
#define BOARD_INITLEDSPINS_LED_RED_CHANNEL 0                         /*!<@brief GPIOA GPIO channel: 0 */
#define BOARD_INITLEDSPINS_LED_RED_PIN_NAME PTE0                     /*!<@brief Pin name */
#define BOARD_INITLEDSPINS_LED_RED_LABEL "LED_RED"              /*!<@brief Label */
#define BOARD_INITLEDSPINS_LED_RED_NAME "RED"                     /*!<@brief Identifier name */
#define BOARD_INITLEDSPINS_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */    

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTC7 (coord N2), U40[1]/K32L_UART0_RX
  @{ */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PERIPHERAL LPUART0           /*!<@brief Device name: LPUART0 */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_SIGNAL RX                    /*!<@brief LPUART0 signal: RX */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PORT PORTC                   /*!<@brief PORT device name: PORTC */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PIN 7U                       /*!<@brief PORTC pin index: 7 */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PIN_NAME LPUART0_RX          /*!<@brief Pin name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_LABEL "U40[1]/K32L_UART0_RX" /*!<@brief Label */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_NAME "DEBUG_UART0_RX"        /*!<@brief Identifier name */
                                                                             /* @} */

/*! @name PORTC8 (coord P3), U11[1]/K32L_UART0_TX
  @{ */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PERIPHERAL LPUART0           /*!<@brief Device name: LPUART0 */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_SIGNAL TX                    /*!<@brief LPUART0 signal: TX */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PORT PORTC                   /*!<@brief PORT device name: PORTC */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PIN 8U                       /*!<@brief PORTC pin index: 8 */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PIN_NAME LPUART0_TX          /*!<@brief Pin name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_LABEL "U11[1]/K32L_UART0_TX" /*!<@brief Label */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_NAME "DEBUG_UART0_TX"        /*!<@brief Identifier name */
                                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

/*! @name EXTAL32 (coord E16), Y1[1]/EXTAL_32KHZ
  @{ */
#define BOARD_INITOSCPINS_EXTAL32_PERIPHERAL RTC            /*!<@brief Device name: RTC */
#define BOARD_INITOSCPINS_EXTAL32_SIGNAL EXTAL32            /*!<@brief RTC signal: EXTAL32 */
#define BOARD_INITOSCPINS_EXTAL32_PIN_NAME EXTAL32          /*!<@brief Pin name */
#define BOARD_INITOSCPINS_EXTAL32_LABEL "Y1[1]/EXTAL_32KHZ" /*!<@brief Label */
#define BOARD_INITOSCPINS_EXTAL32_NAME "EXTAL32"            /*!<@brief Identifier name */
                                                            /* @} */

/*! @name XTAL32 (coord E17), Y1[2]/XTAL_32KHZ
  @{ */
#define BOARD_INITOSCPINS_XTAL32_PERIPHERAL RTC           /*!<@brief Device name: RTC */
#define BOARD_INITOSCPINS_XTAL32_SIGNAL XTAL32            /*!<@brief RTC signal: XTAL32 */
#define BOARD_INITOSCPINS_XTAL32_PIN_NAME XTAL32          /*!<@brief Pin name */
#define BOARD_INITOSCPINS_XTAL32_LABEL "Y1[2]/XTAL_32KHZ" /*!<@brief Label */
#define BOARD_INITOSCPINS_XTAL32_NAME "XTAL32"            /*!<@brief Identifier name */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTE30 (coord G17), U14[4]/ACCEL_I2C3_SCL
  @{ */
#define BOARD_INITACCELPINS_ACCEL_SCL_PERIPHERAL LPI2C3             /*!<@brief Device name: LPI2C3 */
#define BOARD_INITACCELPINS_ACCEL_SCL_SIGNAL SCL                    /*!<@brief LPI2C3 signal: SCL */
#define BOARD_INITACCELPINS_ACCEL_SCL_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN 30U                       /*!<@brief PORTE pin index: 30 */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN_NAME LPI2C3_SCL           /*!<@brief Pin name */
#define BOARD_INITACCELPINS_ACCEL_SCL_LABEL "U14[4]/ACCEL_I2C3_SCL" /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_SCL_NAME "ACCEL_SCL"              /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name PORTE29 (coord G15), U14[6]/ACCEL_I2C3_SDA
  @{ */
#define BOARD_INITACCELPINS_ACCEL_SDA_PERIPHERAL LPI2C3             /*!<@brief Device name: LPI2C3 */
#define BOARD_INITACCELPINS_ACCEL_SDA_SIGNAL SDA                    /*!<@brief LPI2C3 signal: SDA */
#define BOARD_INITACCELPINS_ACCEL_SDA_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN 29U                       /*!<@brief PORTE pin index: 29 */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN_NAME LPI2C3_SDA           /*!<@brief Pin name */
#define BOARD_INITACCELPINS_ACCEL_SDA_LABEL "U14[6]/ACCEL_I2C3_SDA" /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_SDA_NAME "ACCEL_SDA"              /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name PORTE1 (coord R16), U14[11]/ACCEL_INT1
  @{ */
#define BOARD_INITACCELPINS_ACCEL_INT1_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT1_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITACCELPINS_ACCEL_INT1_FGPIO FGPIOE                      /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO_PIN 1U                       /*!<@brief PORTE pin index: 1 */
#define BOARD_INITACCELPINS_ACCEL_INT1_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN 1U                            /*!<@brief PORTE pin index: 1 */
#define BOARD_INITACCELPINS_ACCEL_INT1_CHANNEL 1                         /*!<@brief GPIOE GPIO channel: 1 */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN_NAME PTE1                     /*!<@brief Pin name */
#define BOARD_INITACCELPINS_ACCEL_INT1_LABEL "U14[11]/ACCEL_INT1"        /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_INT1_NAME "ACCEL_INT1"                 /*!<@brief Identifier name */
#define BOARD_INITACCELPINS_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                         /* @} */

/*! @name PORTE22 (coord J16), U14[9]/ACCEL_INT2
  @{ */
#define BOARD_INITACCELPINS_ACCEL_INT2_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT2_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITACCELPINS_ACCEL_INT2_FGPIO FGPIOE                      /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO_PIN 22U                      /*!<@brief PORTE pin index: 22 */
#define BOARD_INITACCELPINS_ACCEL_INT2_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN 22U                           /*!<@brief PORTE pin index: 22 */
#define BOARD_INITACCELPINS_ACCEL_INT2_CHANNEL 22                        /*!<@brief GPIOE GPIO channel: 22 */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN_NAME PTE22                    /*!<@brief Pin name */
#define BOARD_INITACCELPINS_ACCEL_INT2_LABEL "U14[9]/ACCEL_INT2"         /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_INT2_NAME "ACCEL_INT2"                 /*!<@brief Identifier name */
#define BOARD_INITACCELPINS_ACCEL_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                         /* @} */

/*! @name PORTE27 (coord H14), U14[16]/ACCEL_RST
  @{ */
#define BOARD_INITACCELPINS_ACCEL_RST_PERIPHERAL GPIOE                   /*!<@brief Device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_RST_SIGNAL GPIO                        /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITACCELPINS_ACCEL_RST_FGPIO FGPIOE                       /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_INITACCELPINS_ACCEL_RST_GPIO GPIOE                         /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITACCELPINS_ACCEL_RST_GPIO_PIN 27U                       /*!<@brief PORTE pin index: 27 */
#define BOARD_INITACCELPINS_ACCEL_RST_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITACCELPINS_ACCEL_RST_PIN 27U                            /*!<@brief PORTE pin index: 27 */
#define BOARD_INITACCELPINS_ACCEL_RST_CHANNEL 27                         /*!<@brief GPIOE GPIO channel: 27 */
#define BOARD_INITACCELPINS_ACCEL_RST_PIN_NAME PTE27                     /*!<@brief Pin name */
#define BOARD_INITACCELPINS_ACCEL_RST_LABEL "U14[16]/ACCEL_RST"          /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_RST_NAME "ACCEL_RST"                   /*!<@brief Identifier name */
#define BOARD_INITACCELPINS_ACCEL_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTB9 (coord F4), J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3
  @{ */
/*!
 * @brief Device name: GPIOB */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PERIPHERAL GPIOB
/*!
 * @brief GPIOB signal: GPIO */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_SIGNAL GPIO
/*!
 * @brief GPIO device name: GPIOB */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_GPIO GPIOB
/*!
 * @brief PORTB pin index: 9 */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_GPIO_PIN 9U
/*!
 * @brief PORT device name: PORTB */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PORT PORTB
/*!
 * @brief PORTB pin index: 9 */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PIN 9U
/*!
 * @brief GPIOB GPIO channel: 9 */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_CHANNEL 9
/*!
 * @brief Pin name */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PIN_NAME PTB9
/*!
 * @brief Label */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_LABEL "J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3"
/*!
 * @brief Identifier name */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_NAME "SNS_LIGHT_ADC"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLIGHT_SENSORPins(void); /* Function assigned for the Cortex-M4F */

/*! @name USB0_DM (coord T12), J8[2]/K32L_USB_DN
  @{ */
#define BOARD_INITUSBPINS_USB0_DM_PERIPHERAL USB0           /*!<@brief Device name: USB0 */
#define BOARD_INITUSBPINS_USB0_DM_SIGNAL DM                 /*!<@brief USB0 signal: DM */
#define BOARD_INITUSBPINS_USB0_DM_PIN_NAME USB0_DM          /*!<@brief Pin name */
#define BOARD_INITUSBPINS_USB0_DM_LABEL "J8[2]/K32L_USB_DN" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DM_NAME "USB0_DM"            /*!<@brief Identifier name */
                                                            /* @} */

