nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*! @name USB0_DP (coord T11), J8[3]/K32L_USB_DP
  @{ */
#define BOARD_INITUSBPINS_USB0_DP_PERIPHERAL USB0           /*!<@brief Device name: USB0 */
#define BOARD_INITUSBPINS_USB0_DP_SIGNAL DP                 /*!<@brief USB0 signal: DP */
#define BOARD_INITUSBPINS_USB0_DP_PIN_NAME USB0_DP          /*!<@brief Pin name */
#define BOARD_INITUSBPINS_USB0_DP_LABEL "J8[3]/K32L_USB_DP" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DP_NAME "USB0_DP"            /*!<@brief Identifier name */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTD11 (coord R11), J9[P1]/SDHC0_D2
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_D2_PERIPHERAL USDHC0       /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_D2_SIGNAL DATA             /*!<@brief USDHC0 signal: DATA */
#define BOARD_INITSDHCPINS_SDHC0_D2_PORT PORTD              /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_D2_PIN 11U                 /*!<@brief PORTD pin index: 11 */
#define BOARD_INITSDHCPINS_SDHC0_D2_CHANNEL 2               /*!<@brief USDHC0 DATA channel: 2 */
#define BOARD_INITSDHCPINS_SDHC0_D2_PIN_NAME SDHC0_D2       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_D2_LABEL "J9[P1]/SDHC0_D2" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D2_NAME "SDHC0_D2"         /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTD10 (coord P11), J9[P2]/SDHC0_D3
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_D3_PERIPHERAL USDHC0       /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_D3_SIGNAL DATA             /*!<@brief USDHC0 signal: DATA */
#define BOARD_INITSDHCPINS_SDHC0_D3_PORT PORTD              /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_D3_PIN 10U                 /*!<@brief PORTD pin index: 10 */
#define BOARD_INITSDHCPINS_SDHC0_D3_CHANNEL 3               /*!<@brief USDHC0 DATA channel: 3 */
#define BOARD_INITSDHCPINS_SDHC0_D3_PIN_NAME SDHC0_D3       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_D3_LABEL "J9[P2]/SDHC0_D3" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D3_NAME "SDHC0_D3"         /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTD9 (coord U11), J9[P3]/SDHC0_CMD
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PERIPHERAL USDHC0        /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_CMD_SIGNAL CMD               /*!<@brief USDHC0 signal: CMD */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PORT PORTD               /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PIN 9U                   /*!<@brief PORTD pin index: 9 */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PIN_NAME SDHC0_CMD       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_CMD_LABEL "J9[P3]/SDHC0_CMD" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_CMD_NAME "SDHC0_CMD"         /*!<@brief Identifier name */
                                                              /* @} */

/*! @name PORTD8 (coord T9), J9[P5]/SDHC0_DCLK
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PERIPHERAL USDHC0         /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_SIGNAL DCLK               /*!<@brief USDHC0 signal: DCLK */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PORT PORTD                /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PIN 8U                    /*!<@brief PORTD pin index: 8 */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PIN_NAME SDHC0_DCLK       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_LABEL "J9[P5]/SDHC0_DCLK" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_NAME "SDHC0_DCLK"         /*!<@brief Identifier name */
                                                                /* @} */

/*! @name PORTD7 (coord P10), J9[P7]/SDHC0_D0
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_D0_PERIPHERAL USDHC0       /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_D0_SIGNAL DATA             /*!<@brief USDHC0 signal: DATA */
#define BOARD_INITSDHCPINS_SDHC0_D0_PORT PORTD              /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_D0_PIN 7U                  /*!<@brief PORTD pin index: 7 */
#define BOARD_INITSDHCPINS_SDHC0_D0_CHANNEL 0               /*!<@brief USDHC0 DATA channel: 0 */
#define BOARD_INITSDHCPINS_SDHC0_D0_PIN_NAME SDHC0_D0       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_D0_LABEL "J9[P7]/SDHC0_D0" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D0_NAME "SDHC0_D0"         /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTD6 (coord U9), J9[P8]/SDHC0_D1
  @{ */
#define BOARD_INITSDHCPINS_SDHC0_D1_PERIPHERAL USDHC0       /*!<@brief Device name: USDHC0 */
#define BOARD_INITSDHCPINS_SDHC0_D1_SIGNAL DATA             /*!<@brief USDHC0 signal: DATA */
#define BOARD_INITSDHCPINS_SDHC0_D1_PORT PORTD              /*!<@brief PORT device name: PORTD */
#define BOARD_INITSDHCPINS_SDHC0_D1_PIN 6U                  /*!<@brief PORTD pin index: 6 */
#define BOARD_INITSDHCPINS_SDHC0_D1_CHANNEL 1               /*!<@brief USDHC0 DATA channel: 1 */
#define BOARD_INITSDHCPINS_SDHC0_D1_PIN_NAME SDHC0_D1       /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SDHC0_D1_LABEL "J9[P8]/SDHC0_D1" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D1_NAME "SDHC0_D1"         /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTC27 (coord P6), J9[G1]/SD_DETECT
  @{ */
#define BOARD_INITSDHCPINS_SD_DETECT_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITSDHCPINS_SD_DETECT_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITSDHCPINS_SD_DETECT_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSDHCPINS_SD_DETECT_GPIO_PIN 27U                      /*!<@brief PORTC pin index: 27 */
#define BOARD_INITSDHCPINS_SD_DETECT_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITSDHCPINS_SD_DETECT_PIN 27U                           /*!<@brief PORTC pin index: 27 */
#define BOARD_INITSDHCPINS_SD_DETECT_CHANNEL 27                        /*!<@brief GPIOC GPIO channel: 27 */
#define BOARD_INITSDHCPINS_SD_DETECT_PIN_NAME PTC27                    /*!<@brief Pin name */
#define BOARD_INITSDHCPINS_SD_DETECT_LABEL "J9[G1]/SD_DETECT"          /*!<@brief Label */
#define BOARD_INITSDHCPINS_SD_DETECT_NAME "SD_DETECT"                  /*!<@brief Identifier name */
#define BOARD_INITSDHCPINS_SD_DETECT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
